wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/src/Adc_Sar_Ip.c
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
            /* Self-test will only run with CPU mode so clear CTU enable */
#if defined(ADC_MCR_CTUEN_MASK)
            *MCRAddr &= ~(ADC_MCR_CTUEN_MASK);
#endif /* ADC_MCR_CTUEN_MASK */

            /* 2. Program MCR[MODE] = 1 to select Scan mode. ADC_ONE_SHOT_MODE_U32 ADCDIG_CONTINUOUS_MODE_U32*/
            *MCRAddr |= ADC_MCR_MODE(0x1UL);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();
#if ADC_SAR_IP_HAS_SELFTEST_STCR1
            /* 3. Program sampling duration values in STCR1[INPSAMPx].*/
            Reg = 0u;
            Reg |= ADC_STCR1_INPSAMP_S(0x10UL) | ADC_STCR1_INPSAMP_C(0x10UL);
            *STCR1Addr = Reg;
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR1 */

            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_35();
#if ADC_SAR_IP_HAS_SELFTEST_STCR3
            /* 4. Select the self-testing algorithm in STCR3[ALG]. */
            *STCR3Addr |= ADC_STCR3_ALG(0x3UL);
#endif /* ADC_SAR_IP_HAS_SELFTEST_STCR3 */
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_35();

            Adc_Sar_EnableSelftestThreshold(u32Instance);
#ifdef ADC_GPADC_ANA_TEST0_VDAC
            AdcBasePtr->GPADC_ANA_TEST0 &= ~(ADC_GPADC_ANA_TEST0_VDAC_MASK);
            AdcBasePtr->GPADC_ANA_TEST0 |= ADC_GPADC_ANA_TEST0_VDAC(8U);
#endif /* ADC_GPADC_ANA_TEST0_VDAC */
#ifdef ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF
            if (ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_1V6 == ((REG_ACCESS_BY_ADDR(ADC_GPADC_CALCFG0_ADDR) & ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_MASK) >> ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_SHIFT))
            {
#ifdef ADC_GPADC_ANA_CONF_VIN_SE_REF
                /* GPADC_ANA_CONF[VIN_SE_REF] = 1 (enable self-test channel div2 mode) to be aligned with CALCFG0[SET_VREF_OUT_BUF] = 4 (1.6v) (only shown in DDTS) */
                AdcBasePtr->GPADC_ANA_CONF |= ADC_GPADC_ANA_CONF_VIN_SE_REF(1U);
#endif /* ADC_GPADC_ANA_CONF_VIN_SE_REF */
            }
            else if (ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_0V8 == ((REG_ACCESS_BY_ADDR(ADC_GPADC_CALCFG0_ADDR) & ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_MASK) >> ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_SHIFT))
            {
#ifdef ADC_GPADC_ANA_CONF_VIN_SE_REF
                /* GPADC_ANA_CONF[VIN_SE_REF] = 0 (disable self-test channel div2 mode) to be aligned with CALCFG0[SET_VREF_OUT_BUF] = 2 (0.8v) (only shown in DDTS) */
                AdcBasePtr->GPADC_ANA_CONF |= ADC_GPADC_ANA_CONF_VIN_SE_REF(0U);
#endif /* ADC_GPADC_ANA_CONF_VIN_SE_REF */
            }
            else
            {
                /* Overwrite to 4 (1.6v vref) */
                REG_ACCESS_BY_ADDR(ADC_GPADC_CALCFG0_ADDR) &= ~(ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_MASK);
                REG_ACCESS_BY_ADDR(ADC_GPADC_CALCFG0_ADDR) |= ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF(ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF_1V6);
#ifdef ADC_GPADC_ANA_CONF_VIN_SE_REF
                /* GPADC_ANA_CONF[VIN_SE_REF] = 1 (enable self-test channel div2 mode) to be aligned with CALCFG0[SET_VREF_OUT_BUF] = 4 (1.6v) (only shown in DDTS) */
                AdcBasePtr->GPADC_ANA_CONF |= ADC_GPADC_ANA_CONF_VIN_SE_REF(1U);
#endif /* ADC_GPADC_ANA_CONF_VIN_SE_REF */
                /* Wait after changing SET_VREF_OUT_BUF to avoid unstable result */
                TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_BANDGAP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
                CurrentTicks = OsIf_GetCounter(ADC_SAR_IP_TIMEOUT_TYPE);
                ElapsedTicks = 0u;
                while (ElapsedTicks < TimeoutTicks)
                {
                    ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
                }
            }
#endif /* ADC_GPADC_CALCFG0_SET_VREF_OUT_BUF */

            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_35();
            /* 5. Enable the self-testing channel by setting STCR2[EN]. */
            *STCR2Addr |= ADC_STCR2_EN(0x1UL);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_35();

            /* 6. Start the normal conversion by setting MCR[NSTART]. */
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
            *MCRAddr |= ADC_MCR_NSTART(0x1UL);
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();

            /*  Check that all algorithms have executed at least once. */
            Status = Adc_Sar_CheckSelfTestProgress(u32Instance);

            /* Stop the conversion */
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
            *MCRAddr &= ~(ADC_MCR_NSTART(0x1UL));
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();

            if (ADC_SAR_IP_STATUS_SUCCESS == Status)
            {
                /* Read ADC status */
                MsrStatus = ((*MSRAddr) & ADC_MSR_ADCSTATUS_MASK) >> ADC_MSR_ADCSTATUS_SHIFT;
                /* Wait for ADC changes to the expected Idle mode, The bitfield MSR[ADCSTATUS] should be checked to Idle state when MCR[NSTART] is written to 0 */
                TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
                ElapsedTicks = 0U;
                while ((MsrStatus != ADC_MSR_ADCSTATUS(ADC_SAR_IP_MSR_ADCSTATUS_IDLE)) && (ElapsedTicks < TimeoutTicks))
                {
                    MsrStatus = ((*MSRAddr) & ADC_MSR_ADCSTATUS_MASK) >> ADC_MSR_ADCSTATUS_SHIFT;
                    ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
                }
            }

            Adc_Sar_DisableSelftestThreshold(u32Instance);

#ifdef ADC_GPADC_ANA_TEST0_VDAC
            AdcBasePtr->GPADC_ANA_TEST0 &= ~(ADC_GPADC_ANA_TEST0_VDAC_MASK);
#endif /* ADC_GPADC_ANA_TEST0_VDAC */
#ifdef ADC_GPADC_ANA_CONF_VIN_SE_REF
            AdcBasePtr->GPADC_ANA_CONF &= ~(ADC_GPADC_ANA_CONF_VIN_SE_REF_MASK);
#endif /* ADC_GPADC_ANA_CONF_VIN_SE_REF */

            /* Disable Self-test */
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_35();
            *STCR2Addr &= ~(ADC_STCR2_EN(0x1UL));
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_35();

#if ADC_SAR_IP_SELFTEST_FULL_CLK
        }
        if (ADC_SAR_IP_STATUS_SUCCESS == Status)
        {
            /* Enter into power-down Mode */
            Status = Adc_Sar_Ip_Powerdown(u32Instance);
#if ADC_SAR_IP_HAS_ADCLKSEL
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();
            /* Restore the state of ADCLKSEL */
            *MCRAddr &= ~(ADC_MCR_ADCLKSEL_MASK);
            *MCRAddr |= AdcClkSel;
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */

            if (ADC_SAR_IP_STATUS_SUCCESS == Status)
            {
                /* Exit into power-down Mode */
                Status = Adc_Sar_Ip_Powerup(u32Instance);
                if (ADC_SAR_IP_STATUS_SUCCESS == Status)
#endif /* ADC_SAR_IP_SELFTEST_FULL_CLK */
                {
                    if (ElapsedTicks >= TimeoutTicks)
                    {
                        Status = ADC_SAR_IP_STATUS_TIMEOUT;
                    }
                }
#if ADC_SAR_IP_SELFTEST_FULL_CLK
            }
        }
    }
#endif /* ADC_SAR_IP_SELFTEST_FULL_CLK */

