wdsll/stm32f407_Eth_Fsmc/E_couple/RTD/src/Adc_Sar_Ip.c
#if FEATURE_ADC_HAS_CALIBRATION
/*FUNCTION**********************************************************************
*
* Function Name : Adc_Sar_Ip_DoCalibration
* Description   : This functions executes a calibration sequence. It is recommended
*  to run this sequence before using the ADC converter. The maximum clock frequency
*  for the calibration is 40 MHz, this function sets the ADCLKSEL bit resulting in
*  a maximum input clock frequency of 80 MHz.
*
* @implements      Adc_Sar_Ip_DoCalibration_Activity
* END**************************************************************************/
Adc_Sar_Ip_StatusType Adc_Sar_Ip_DoCalibration(const uint32 u32Instance)
{
    ADC_Type * AdcBasePtr = NULL_PTR;
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    SAR_ADC_AE_Type * AdcAEBasePtr = NULL_PTR;
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    Adc_Sar_Ip_StatusType Status = ADC_SAR_IP_STATUS_SUCCESS;
    Adc_Sar_Ip_StatusType CalStatus = ADC_SAR_IP_STATUS_SUCCESS;
    uint32 TimeoutTicks = OsIf_MicrosToTicks(ADC_SAR_IP_TIMEOUT_VAL, ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 CurrentTicks = OsIf_GetCounter(ADC_SAR_IP_TIMEOUT_TYPE);
    uint32 ElapsedTicks = 0u;
#if ADC_SAR_IP_HAS_ADCLKSEL
    uint32 AdcClkSel = 0u;
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */
    uint32 AdcAutoClkOff = 0u;
    uint32 Mcr;
    volatile uint32 * MCRAddr = NULL_PTR;
#if (!ADC_SAR_IP_CALIBRATION_USES_MCR || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
    uint32 Calbistreg;
    volatile uint32 * CALBISTREGAddr = NULL_PTR;
#if defined(ADC_CAL2_ENX_MASK)
    volatile uint32 * CAL2Addr = NULL_PTR;
#endif /* defined(ADC_CAL2_ENX_MASK) */
#endif /* (!ADC_SAR_IP_CALIBRATION_USES_MCR || FEATURE_ADC_HAS_APPLICATION_EXTENSION) */

#if (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON)
    DevAssert(u32Instance < ADC_SAR_IP_INSTANCE_COUNT);
#endif /* (ADC_SAR_IP_DEV_ERROR_DETECT == STD_ON) */

#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
    if (u32Instance >= ADC_INSTANCE_COUNT)
    {
        AdcAEBasePtr = Adc_Sar_AE_Ip_apxAdcBase[u32Instance - ADC_INSTANCE_COUNT];
        MCRAddr = &(AdcAEBasePtr->MCR);
        CALBISTREGAddr = &(AdcAEBasePtr->CALBISTREG);
#if defined(ADC_CAL2_ENX_MASK)
        CAL2Addr = &(AdcAEBasePtr->CAL2);
#endif /* defined(ADC_CAL2_ENX_MASK) */
    }
    else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
    {
        AdcBasePtr = Adc_Sar_Ip_apxAdcBase[u32Instance];
        MCRAddr = &(AdcBasePtr->MCR);
#if !ADC_SAR_IP_CALIBRATION_USES_MCR
        CALBISTREGAddr = &(AdcBasePtr->CALBISTREG);
#if defined(ADC_CAL2_ENX_MASK)
        CAL2Addr = &(AdcBasePtr->CAL2);
#endif /* defined(ADC_CAL2_ENX_MASK) */
#endif /* !ADC_SAR_IP_CALIBRATION_USES_MCR */
    }

    /* Set CLKSEL to CalibrationClkSelect value */
    Status = Adc_Sar_Ip_Powerdown(u32Instance);
    if (ADC_SAR_IP_STATUS_SUCCESS == Status)
    {
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_12();
        Mcr = *MCRAddr;
#if ADC_SAR_IP_HAS_ADCLKSEL
        /* Save the current state of ADCLKSEL in order to restore it */
        AdcClkSel = (Mcr & ADC_MCR_ADCLKSEL_MASK);
        Mcr &= ~(ADC_MCR_ADCLKSEL_MASK);
        Mcr |= Adc_Sar_GetADCLKSELValue(Adc_Sar_Ip_axAdcSarState[u32Instance].CalibrationClkSelect);
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */
        /* Save the current state of ADCKO in order to restore it */
        AdcAutoClkOff = *MCRAddr & ADC_MSR_ACKO_MASK;
        /* Disable AutoClockOff */
        Mcr &= ~(ADC_MCR_ACKO_MASK);
        *MCRAddr = Mcr;
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_12();

        Status = Adc_Sar_Ip_Powerup(u32Instance);
        if (ADC_SAR_IP_STATUS_SUCCESS == Status)
        {
#if (!ADC_SAR_IP_CALIBRATION_USES_MCR || FEATURE_ADC_HAS_APPLICATION_EXTENSION)
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
            if (u32Instance >= ADC_INSTANCE_COUNT)
            {
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_36();
                Calbistreg = *CALBISTREGAddr;
                /* clear the bits and set to calibration values */
                Calbistreg &= ~(ADC_SAR_IP_CALBISTREG_TSAMP_MASK | ADC_SAR_IP_CALBISTREG_NR_SMPL_MASK | ADC_SAR_IP_CALBISTREG_AVG_EN_MASK | ADC_SAR_IP_CALBISTREG_TEST_EN_MASK);
                Calbistreg |= ADC_SAR_IP_CALBISTREG_NR_SMPL(0x03u) | ADC_SAR_IP_CALBISTREG_AVG_EN(1U);
                *CALBISTREGAddr = Calbistreg;
                /* clear the calibration failed before a new calibration */
                *CALBISTREGAddr |= ADC_SAR_IP_CALBISTREG_TEST_FAIL_MASK;
                /* Disable the error correction for the smaller capacitances in the CDAC of the ADC */
#if defined(ADC_CAL2_ENX_MASK)
                *CAL2Addr &= ~(ADC_CAL2_ENX_MASK);
#endif /* defined(ADC_CAL2_ENX_MASK) */
                /* Start calibration */
                *CALBISTREGAddr |= ADC_SAR_IP_CALBISTREG_TEST_EN(1U);
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_36();

                /* Wait for calibration to finish */
                ElapsedTicks = 0U;
                while (((*CALBISTREGAddr & ADC_SAR_IP_CALBISTREG_C_T_BUSY_MASK) != 0U) && (ElapsedTicks < TimeoutTicks))
                {
                    ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
                }
                if (ElapsedTicks >= TimeoutTicks)
                {
                    CalStatus = ADC_SAR_IP_STATUS_TIMEOUT;
                }
                else if ((*CALBISTREGAddr & ADC_SAR_IP_CALBISTREG_TEST_FAIL_MASK) != 0U)
                {
                    /* If the calibration failed, return error */
                    CalStatus = ADC_SAR_IP_STATUS_ERROR;
                }
                else
                {
                    ; /* Empty else branch to avoid MISRA */
                }
#if FEATURE_ADC_HAS_APPLICATION_EXTENSION
            }
            else
#endif /* FEATURE_ADC_HAS_APPLICATION_EXTENSION */
#endif /* (!ADC_SAR_IP_CALIBRATION_USES_MCR || FEATURE_ADC_HAS_APPLICATION_EXTENSION) */
            {
#if ADC_SAR_IP_CALIBRATION_USES_MCR
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_12();
                /* Clear the bits and set to calibration values */
                Mcr = AdcBasePtr->MCR;
                Mcr &= ~(ADC_MCR_TSAMP_MASK | ADC_MCR_NRSMPL_MASK | ADC_MCR_AVGEN_MASK);
                Mcr |= ADC_MCR_NRSMPL(0x03u) | ADC_MCR_AVGEN(1U);
                AdcBasePtr->MCR = Mcr;

                /* Start calibration */
                AdcBasePtr->MCR |= ADC_MCR_CALSTART(1U);
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_12();

                /* Wait for calibration to finish */
                while (((AdcBasePtr->MSR & ADC_MSR_CALBUSY_MASK) != 0U) && (ElapsedTicks < TimeoutTicks))
                {
                    ElapsedTicks += OsIf_GetElapsed(&CurrentTicks, ADC_SAR_IP_TIMEOUT_TYPE);
                }

                if (ElapsedTicks >= TimeoutTicks)
                {
                    CalStatus = ADC_SAR_IP_STATUS_TIMEOUT;
                }
                else if ((AdcBasePtr->MSR & ADC_MSR_CALFAIL_MASK) != 0U)
                {
                    /* If the calibration failed, return error */
                    CalStatus = ADC_SAR_IP_STATUS_ERROR;
                }
                else
                {
                    ; /* Empty else branch to avoid MISRA */
                }
#endif /* ADC_SAR_IP_CALIBRATION_USES_MCR */
            }

            /* Restore the state of ADCLKSEL */
            Status = Adc_Sar_Ip_Powerdown(u32Instance);
        }

        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_12();
        Mcr = *MCRAddr;
#if ADC_SAR_IP_HAS_ADCLKSEL
        Mcr &= ~(ADC_MCR_ADCLKSEL_MASK);
        Mcr |= AdcClkSel;
#endif /* ADC_SAR_IP_HAS_ADCLKSEL */
        Mcr |= AdcAutoClkOff;
        *MCRAddr = Mcr;
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_12();

        if (ADC_SAR_IP_STATUS_SUCCESS == Status)
        {
            Status = Adc_Sar_Ip_Powerup(u32Instance);

            if (ADC_SAR_IP_STATUS_SUCCESS != CalStatus)
            {
                Status = CalStatus;
            }
        }
    }

